FV2410/E_0445.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">6.34.1: AD: Geschäftsdatenanfrage von ÜNB</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0445</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> NB</B></FONT><BR align="center"/>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Handelt es sich um eine kostenpflichtige Konfiguration?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Kostenpflichtige Konfiguration<BR align="left"/></FONT>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>20: </B>Handelt sich um eine Bestellung einer Konfiguration einer Änderung des Bilanzierungsverfahrens (Prognosegrundlage)?<BR align="left"/>>];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>30: </B>Handelt es sich um eine Bestellung einer Konfiguration einer Zählzeitdefinition<BR align="left"/>>];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>40: </B>Handelt es sich um eine Marktlokation mit der messtechnischen Einordnung „iMS“ oder um eine Marktlokation, bei der alle Messlokationen mit einem Zähler des Typs Lastgangzähler ausgestattet sind?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Marktlokation befindet sich nicht in der messtechnischen Einordnung „iMS“ oder es handelt sich nicht um eine Marktlokation, bei der alle Messlokationen mit einem Zähler des Typs Lastgangzähler ausgestattet sind.<BR align="left"/></FONT>>];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>50: </B>Entspricht der geplante Termin zur Änderung der Prognosegrundlage den Prozessfristvorgaben?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Fristüberschreitung<BR align="left"/></FONT>>];
    "60" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>60: </B>Handelt es sich um eine verbrauchende Marktlokation?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Erzeugende Marktlokationen mit iMS oder kME/ RLM werden immer auf der Prognosegrundlage auf Basis von Werten bilanziert.<BR align="left"/></FONT>>];
    "70" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>70: </B>Liegt eine Zuordnungsermächtigung für den sich aus der gewünschten Prognosegrundlage ergebenden ZRT vor?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Zuordnungsermächtigung liegt nicht vor.<BR align="left"/></FONT>>];
    "80" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>80: </B>Ist die gewünschte Prognosegrundlage auf Basis von Profilen angegeben?<BR align="left"/>>];
    "90" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>90: </B>Befindet sich die Marktlokation in einem Lokationsbündel, in welchem ebenfalls eine erzeugende Marktlokation vorhanden ist?<BR align="left"/>>];
    "100" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>100: </B>Entspricht die erzeugte Energiemenge der Marktlokation der gemessenen Energiemenge in der Flussrichtung Erzeugung an der Messlokation der Netzübergabe?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Keine Volleinspeisung, keine Prognosegrundlage auf Basis von Profilen möglich<BR align="left"/></FONT>>];
    "110" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>110: </B>Handelt es sich um eine Marktlokation mit der messtechnischen Einordnung „iMS“?<BR align="left"/>>];
    "120" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>120: </B>Besteht für die Marktlokation ein Wahlrecht zur Änderung der Prognosegrundlage durch den LF?<BR align="left"/>>];
    "A07" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A07</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Kein Wahlrecht der Prognosegrundlage für die Marktlokation<BR align="left"/></FONT>>];
    "130" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>130: </B>Ist die gewünschte Prognosegrundlage zum gewünschten Termin bereits umgesetzt?<BR align="left"/>>];
    "A08" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A08</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Änderung zum gewünschten Termin bereits umgesetzt.<BR align="left"/></FONT>>];
    "140" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>140: </B>Handelt es sich bei der Marktlokation um eine verbrauchende Marktlokation?<BR align="left"/>>];
    "A10" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A10</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Bestellungen sind nur für verbrauchende Marktlokationen möglich<BR align="left"/></FONT>>];
    "150" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>150: </B>Handelt es sich bei der Bestellung um eine Rückkehr auf eine Eintariflogik?<BR align="left"/>>];
    "160" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>160: </B>Ist die gewünschte Zählzeit zum Anwendungszeitpunkt Bestandteil der Übersicht der Zählzeitdefinition, welche zuvor vom NB übermittelt wurde?<BR align="left"/>>];
    "A11" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A11</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung <BR align="left"/>Zählzeitdefinition zum Anwendungszeitpunkt nicht bekannt<BR align="left"/></FONT>>];
    "170" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>170: </B>Ist die in der Bestellung genannte Zählzeit in der Übersicht der Zählzeitdefinition des NB als eine bestellbare Zählzeit gekennzeichnet?<BR align="left"/>>];
    "A12" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A12</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung <BR align="left"/>Zählzeit ist nicht bestallbar<BR align="left"/></FONT>>];
    "180" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>180: </B>Liegt zum Anwendungszeitpunkt die ausgerollte Zählzeit zur Zählzeitdefinition vor?<BR align="left"/>>];
    "A13" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A13</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung <BR align="left"/>Ausgerollte Zählzeit zur Zählzeitdefinition liegt zum Anwendungszeitpunkt nicht vor<BR align="left"/></FONT>>];
    "190" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>190: </B>Ist der bestellte Zustand bereits vorhanden?<BR align="left"/>>];
    "A14" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A14</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Bestellter Zustand bereits vorhanden<BR align="left"/></FONT>>];
    "200" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>200: </B>Ist die gewünschte Konfiguration grundsätzlich möglich?<BR align="left"/>>];
    "A15" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A15</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung <BR align="left"/>Konfiguration technisch nicht möglich<BR align="left"/>Hinweis: z. B. Zählzeit bestellt und Eintarifzähler verbaut<BR align="left"/></FONT>>];
    "210" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>210: </B>Wurde die Vorlauffristen zu der geplanten Änderung der Gerätekonfiguration eingehalten?<BR align="left"/>>];
    "A16" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A16</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung <BR align="left"/>Fristüberschreitung<BR align="left"/></FONT>>];
    "220" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>220: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A99" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A99</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung <BR align="left"/>Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.10.2024 00:00 Uhr<BR align="left"/></FONT>>];
    "A17" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A17</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Bestellung wird an den MSB der Marktlokation weitergeleitet<BR align="left"/></FONT>>];

    "Start" -> "10";
    "10" -> "A01" [label="Ja"];
    "10" -> "20" [label="Nein"];
    "20" -> "40" [label="Ja"];
    "20" -> "30" [label="Nein"];
    "30" -> "140" [label="Ja"];
    "30" -> "190" [label="Nein"];
    "40" -> "A02" [label="Nein"];
    "40" -> "50" [label="Ja"];
    "50" -> "A03" [label="Nein"];
    "50" -> "60" [label="Ja"];
    "60" -> "A04" [label="Nein"];
    "60" -> "70" [label="Ja"];
    "70" -> "A05" [label="Nein"];
    "70" -> "80" [label="Ja"];
    "80" -> "90" [label="Ja"];
    "80" -> "110" [label="Nein"];
    "90" -> "100" [label="Ja"];
    "90" -> "110" [label="Nein"];
    "100" -> "A06" [label="Nein"];
    "100" -> "110" [label="Ja"];
    "110" -> "120" [label="Ja"];
    "110" -> "130" [label="Nein"];
    "120" -> "A07" [label="Nein"];
    "120" -> "130" [label="Ja"];
    "130" -> "A08" [label="Ja"];
    "130" -> "220" [label="Nein"];
    "140" -> "A10" [label="Nein"];
    "140" -> "150" [label="Ja"];
    "150" -> "190" [label="Ja"];
    "150" -> "160" [label="Nein"];
    "160" -> "A11" [label="Nein"];
    "160" -> "170" [label="Ja"];
    "170" -> "A12" [label="Nein"];
    "170" -> "180" [label="Ja"];
    "180" -> "A13" [label="Nein"];
    "180" -> "190" [label="Ja"];
    "190" -> "A14" [label="Ja"];
    "190" -> "200" [label="Nein"];
    "200" -> "210" [label="Ja"];
    "200" -> "A15" [label="Nein"];
    "210" -> "220" [label="Ja"];
    "210" -> "A16" [label="Nein"];
    "220" -> "A99" [label="Ja"];
    "220" -> "A17" [label="Nein"];

    bgcolor="transparent";
}
